def showmain():
    print("---------------------------------------------------------------------------------")
    print("欢迎来到资源库！")
    print("版本：1.0版本（本版本以百度网盘作为平台，提取码为题目的答案 or 提示所指代的东西）")
    print("---------------------------------------------------------------------------------")
def input1():
    print("-----------------------------")
    print("欢迎进入资源包模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input2():
    print("-----------------------------")
    print("欢迎进入电脑资源包模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input21():
    print("-----------------------------")
    print("欢迎进入电脑资源包-office模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input3():
    print("-----------------------------")
    print("欢迎进入开发资源包模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input31():
    print("-----------------------------")
    print("欢迎进入开发资源包-C++&C模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input32():
    print("-----------------------------")
    print("欢迎进入开发资源包-Python模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input33():
    print("-----------------------------")
    print("欢迎进入开发资源包-iOS模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input34():
    print("-----------------------------")
    print("欢迎进入开发资源包-Android模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input35():
    print("-----------------------------")
    print("欢迎进入开发资源包-Java&Kotlin模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")
def input36():
    print("-----------------------------")
    print("欢迎进入开发资源包-其他模块！")
    print("版本：1.0（与资源库版本同步）")
    print("-----------------------------")